## Pandas

Documentação do Pandas:
    https://pandas.pydata.org/docs/user_guide/index.html

In [1]:
# Instala a versão exata do pacote
#!pip instal -q pandas==1.5.3
# ! -> vai para o sistema operacional
# - q quiet
#== versão exata

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.5.3'

## Manipulando Dados em DataFrames do Pandas

In [4]:
# Cria um dicionário
dados = {'Estado': ['Santa Catarina', 'Rio de Janeiro','Tocantins','Bahia', 'Minas Gerais'],
        'Ano': [2004, 2005, 2006, 2007, 2008],
        'Taxa Desemprego':[1.5, 1.7, 1.6, 2.4, 2.7]}

In [5]:
print(dados)

{'Estado': ['Santa Catarina', 'Rio de Janeiro', 'Tocantins', 'Bahia', 'Minas Gerais'], 'Ano': [2004, 2005, 2006, 2007, 2008], 'Taxa Desemprego': [1.5, 1.7, 1.6, 2.4, 2.7]}

In [6]:
type(dados)

dict

In [7]:
# Importar função DataFrame do Pandas
from pandas import DataFrame

In [8]:
# Convert o dict em dataframe
df = DataFrame(dados)

In [9]:
print(df)

           Estado   Ano  Taxa Desemprego
0  Santa Catarina  2004              1.5
1  Rio de Janeiro  2005              1.7
2       Tocantins  2006              1.6
3           Bahia  2007              2.4
4    Minas Gerais  2008              2.7

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
#Visualiza 5 primeiras linhas (em tabelinha formatada)
df.head()

           Estado   Ano  Taxa Desemprego
0  Santa Catarina  2004              1.5
1  Rio de Janeiro  2005              1.7
2       Tocantins  2006              1.6
3           Bahia  2007              2.4
4    Minas Gerais  2008              2.7

In [12]:
# Reorganizando as colunas
DataFrame(dados, columns = ['Estado', 'Taxa Desemprego', 'Ano'])   # inverter a segunda com a 3. coluna!

           Estado  Taxa Desemprego   Ano
0  Santa Catarina              1.5  2004
1  Rio de Janeiro              1.7  2005
2       Tocantins              1.6  2006
3           Bahia              2.4  2007
4    Minas Gerais              2.7  2008

In [13]:
# Outro dataframe, com mais uma coluna
df2 = DataFrame(dados,
               columns = ['Estado', 'Taxa Desemprego', 'Taxa crescimento','Ano'],  # nova col: Taxa crescimento
               index = ['estado1', 'estado2', 'estado3', 'estado4', 'estado5'])    # nome do indice de cada coluna!

In [14]:
df2

                 Estado  Taxa Desemprego Taxa crescimento   Ano
estado1  Santa Catarina              1.5              NaN  2004
estado2  Rio de Janeiro              1.7              NaN  2005
estado3       Tocantins              1.6              NaN  2006
estado4           Bahia              2.4              NaN  2007
estado5    Minas Gerais              2.7              NaN  2008

In [15]:
df2.columns

Index(['Estado', 'Taxa Desemprego', 'Taxa crescimento', 'Ano'], dtype='object')

In [16]:
# Imprimindo apenas a coluna específica
df2['Estado']

estado1    Santa Catarina
estado2    Rio de Janeiro
estado3         Tocantins
estado4             Bahia
estado5      Minas Gerais
Name: Estado, dtype: object

In [17]:
df2.values

array([['Santa Catarina', 1.5, nan, 2004],
       ['Rio de Janeiro', 1.7, nan, 2005],
       ['Tocantins', 1.6, nan, 2006],
       ['Bahia', 2.4, nan, 2007],
       ['Minas Gerais', 2.7, nan, 2008]], dtype=object)

In [18]:
df2.dtypes

Estado               object
Taxa Desemprego     float64
Taxa crescimento     object
Ano                   int64
dtype: object

In [19]:
df2.columns  # título das colunas

Index(['Estado', 'Taxa Desemprego', 'Taxa crescimento', 'Ano'], dtype='object')

In [20]:
# Imprimindo apenas uma coluna do DataFrame
df2[['Taxa Desemprego', 'Ano']]      #nomes das colunas são case sensitive!

         Taxa Desemprego   Ano
estado1              1.5  2004
estado2              1.7  2005
estado3              1.6  2006
estado4              2.4  2007
estado5              2.7  2008

In [21]:
df2.index  # nomeou-se os indices (0,1,2...) para outros nomes

Index(['estado1', 'estado2', 'estado3', 'estado4', 'estado5'], dtype='object')

In [22]:
# Filtrando pelo índice
df2.filter(items = ['estado3'],axis = 0)

            Estado  Taxa Desemprego Taxa crescimento   Ano
estado3  Tocantins              1.6              NaN  2006

### Usando NumPy e Pandas para Manipulação de Dados

In [23]:
df2.head()

                 Estado  Taxa Desemprego Taxa crescimento   Ano
estado1  Santa Catarina              1.5              NaN  2004
estado2  Rio de Janeiro              1.7              NaN  2005
estado3       Tocantins              1.6              NaN  2006
estado4           Bahia              2.4              NaN  2007
estado5    Minas Gerais              2.7              NaN  2008

In [24]:
df2.dtypes

Estado               object
Taxa Desemprego     float64
Taxa crescimento     object
Ano                   int64
dtype: object

In [25]:
# Resumo estatístico do DataFrame
df2.describe()      # Somente calcula categoria de variåvel numérica. Object e outros são ignorados

       Taxa Desemprego          Ano
count         5.000000     5.000000
mean          1.980000  2006.000000
std           0.535724     1.581139
min           1.500000  2004.000000
25%           1.600000  2005.000000
50%           1.700000  2006.000000
75%           2.400000  2007.000000
max           2.700000  2008.000000

In [26]:
df2.isna()  # Retorna se o valor retorna NaN  (=True)

         Estado  Taxa Desemprego  Taxa crescimento    Ano
estado1   False            False              True  False
estado2   False            False              True  False
estado3   False            False              True  False
estado4   False            False              True  False
estado5   False            False              True  False

In [27]:
df2['Taxa crescimento'].isna()

estado1    True
estado2    True
estado3    True
estado4    True
estado5    True
Name: Taxa crescimento, dtype: bool

In [28]:
# Importar numpy
import numpy as np

In [29]:
# Usando o NumPy para alimentar uma das colunas do dataframe
df2['Taxa crescimento'] = np.arange(5.)   # vai de .5 em .5

In [30]:
df2

                 Estado  Taxa Desemprego  Taxa crescimento   Ano
estado1  Santa Catarina              1.5               0.0  2004
estado2  Rio de Janeiro              1.7               1.0  2005
estado3       Tocantins              1.6               2.0  2006
estado4           Bahia              2.4               3.0  2007
estado5    Minas Gerais              2.7               4.0  2008

In [31]:
df2['Taxa crescimento'].isna()

estado1    False
estado2    False
estado3    False
estado4    False
estado5    False
Name: Taxa crescimento, dtype: bool

In [32]:
df2.dtypes

Estado               object
Taxa Desemprego     float64
Taxa crescimento    float64
Ano                   int64
dtype: object

In [33]:
# Resumo estatístico
df2.describe()  # agora a coluna da taxa crescimento é calculada...

       Taxa Desemprego  Taxa crescimento          Ano
count         5.000000          5.000000     5.000000
mean          1.980000          2.000000  2006.000000
std           0.535724          1.581139     1.581139
min           1.500000          0.000000  2004.000000
25%           1.600000          1.000000  2005.000000
50%           1.700000          2.000000  2006.000000
75%           2.400000          3.000000  2007.000000
max           2.700000          4.000000  2008.000000

## Slicing de DataFrames no Pandas

In [34]:
df2['estado2':'estado4']   #intervalo com nomes de indices

                 Estado  Taxa Desemprego  Taxa crescimento   Ano
estado2  Rio de Janeiro              1.7               1.0  2005
estado3       Tocantins              1.6               2.0  2006
estado4           Bahia              2.4               3.0  2007

In [35]:
df2[df2['Taxa Desemprego'] < 2]  # where - listar somente o que satisfizer a cláusula. [] -> fatiar  o DataFrame

                 Estado  Taxa Desemprego  Taxa crescimento   Ano
estado1  Santa Catarina              1.5               0.0  2004
estado2  Rio de Janeiro              1.7               1.0  2005
estado3       Tocantins              1.6               2.0  2006

In [36]:
df2[['Estado', 'Taxa crescimento']]  # slice de 2 colunas apenas.

                 Estado  Taxa crescimento
estado1  Santa Catarina               0.0
estado2  Rio de Janeiro               1.0
estado3       Tocantins               2.0
estado4           Bahia               3.0
estado5    Minas Gerais               4.0

In [37]:
df2[['Estado']]  # somente 1 coluna, precisa colocar entre [] para fazer o slicing

                 Estado
estado1  Santa Catarina
estado2  Rio de Janeiro
estado3       Tocantins
estado4           Bahia
estado5    Minas Gerais

## Preenchendo valores ausentes em DataFrames do Pandas

In [38]:
# Importar um dataset
dsa_df = pd.read_csv("dataset.csv")

In [39]:
dsa_df.head(5)  # 5 é o n. padrão, não precisa colocar!

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
0,1,FAB0d41d5b5d22c,Ferrell LLC,https://price.net/,Papua New Guinea,Horizontal empowering knowledgebase,1990,Plastics,3498.0
1,2,6A7EdDEA9FaDC52,"Mckinney, Riley and Day",http://www.hall-buchanan.info/,Finland,User-centric system-worthy leverage,2015,Glass / Ceramics / Concrete,4952.0
2,3,0bFED1ADAE4bcC1,Hester Ltd,http://sullivan-reed.com/,China,Switchable scalable moratorium,1971,Public Safety,NaN
3,4,2bFC1Be8a4ce42f,Holder-Sellers,https://becker.com/,Turkmenistan,De-engineered systemic artificial intelligence,2004,Automotive,NaN
4,5,9eE8A6a4Eb96C24,Mayer Group,http://www.brewer.com/,Mauritius,Synchronized needs-based challenge,1991,Transportation,NaN

In [40]:
dsa_df.isna().sum()

Index                  0
Organization Id        0
Name                   0
Website                0
Country                0
Description            0
Founded                0
Industry               0
Number of employees    4
dtype: int64

In [41]:
# Extraímos a moda da coluna Quantity
moda = dsa_df['Number of employees'].value_counts().index[0]

In [42]:
print(moda)

3498.0

In [43]:
# Preencher os valores NA com a moda
dsa_df['Number of employees'].fillna(value = moda, inplace = True)   #interpolação, usando a moda. 
# inplace = True -> salva no próprio dataframe. Se não for usado, salva em uma cópia

In [44]:
dsa_df.isna().sum()

Index                  0
Organization Id        0
Name                   0
Website                0
Country                0
Description            0
Founded                0
Industry               0
Number of employees    0
dtype: int64

## Query de Dados no DataFrame do Pandas

In [45]:
dsa_df.head()

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
0,1,FAB0d41d5b5d22c,Ferrell LLC,https://price.net/,Papua New Guinea,Horizontal empowering knowledgebase,1990,Plastics,3498.0
1,2,6A7EdDEA9FaDC52,"Mckinney, Riley and Day",http://www.hall-buchanan.info/,Finland,User-centric system-worthy leverage,2015,Glass / Ceramics / Concrete,4952.0
2,3,0bFED1ADAE4bcC1,Hester Ltd,http://sullivan-reed.com/,China,Switchable scalable moratorium,1971,Public Safety,3498.0
3,4,2bFC1Be8a4ce42f,Holder-Sellers,https://becker.com/,Turkmenistan,De-engineered systemic artificial intelligence,2004,Automotive,3498.0
4,5,9eE8A6a4Eb96C24,Mayer Group,http://www.brewer.com/,Mauritius,Synchronized needs-based challenge,1991,Transportation,3498.0

In [46]:
# Checando valores máximos e mínimos  da coluna Number of employees
dsa_df['Number of employees'].describe()

count     100.000000
mean     4914.860000
std      2821.401736
min       236.000000
25%      2842.750000
50%      4731.000000
75%      7495.250000
max      9995.000000
Name: Number of employees, dtype: float64

In [47]:
# Novo dataframe apenas com o intervalo entre 4914 e 7495
df2 = dsa_df.query('4914 < `Number of employees` < 7495')

In [48]:
df2['Number of employees'].describe()

count      24.000000
mean     6184.708333
std       935.118848
min      4941.000000
25%      5107.000000
50%      6157.000000
75%      7012.250000
max      7484.000000
Name: Number of employees, dtype: float64

In [49]:
# Novo dataframe apenas com valores acima da média
df3 = df2.query('`Number of employees` > 6184')

In [50]:
df3.head()

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
10,11,AE61b8Ffebbc476,Kidd Group,http://www.lyons.com/,Bouvet Island (Bouvetoya),Proactive foreground paradigm,2001,Primary / Secondary Education,7473.0
16,17,68139b5C4De03B4,"Bowers, Guerra and Krause",http://www.carrillo-nicholson.com/,Uganda,De-engineered transitional strategy,1972,Primary / Secondary Education,6986.0
33,34,5Cd7efccCcba38f,Burch-Ewing,http://cline.net/,Taiwan,User-centric 4thgeneration system engine,1981,Venture Capital / VC,7443.0
44,45,235fdEFE2cfDa5F,Brock-Blackwell,http://www.small.com/,Benin,Secured foreground emulation,1986,Online Publishing,7034.0
56,57,2a74D6f3D3B268e,"Cherry, Le and Callahan",https://waller-delacruz.biz/,Nigeria,Universal human-resource collaboration,2017,Entertainment / Movie Production,7202.0

## Verificando a ocorrência de diversos valores em uma coluna

In [51]:
dsa_df.shape  # n. de linhas, n. de colunas

(100, 9)

In [52]:
#Filtro isin(), verificar por valores específicos
dsa_df[dsa_df['Number of employees'].isin([7473,7443])]

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
10,11,AE61b8Ffebbc476,Kidd Group,http://www.lyons.com/,Bouvet Island (Bouvetoya),Proactive foreground paradigm,2001,Primary / Secondary Education,7473.0
33,34,5Cd7efccCcba38f,Burch-Ewing,http://cline.net/,Taiwan,User-centric 4thgeneration system engine,1981,Venture Capital / VC,7443.0

In [53]:
# Shape do filtro - mostra o resultado do fatiamento
dsa_df[dsa_df['Number of employees'].isin([7473,7443])].shape

(2, 9)

In [55]:
#Filtra e exibe apenas a primeira linha
dsa_df[dsa_df['Number of employees'].isin([7473,7443])][:1]

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
10,11,AE61b8Ffebbc476,Kidd Group,http://www.lyons.com/,Bouvet Island (Bouvetoya),Proactive foreground paradigm,2001,Primary / Secondary Education,7473.0

## Operadores Lógicos para manipulação de dados com Pandas

In [56]:
#Filtrando / slicing  - regras entre (), utilizando AND (&)
dsa_df[ (dsa_df.Country == 'Taiwan') & (dsa_df.Founded == 1981)].head()

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
33,34,5Cd7efccCcba38f,Burch-Ewing,http://cline.net/,Taiwan,User-centric 4thgeneration system engine,1981,Venture Capital / VC,7443.0

In [59]:
#Filtrando / slicing  - regras entre (), utilizando OR (|) , tail (traz o final)
dsa_df[ (dsa_df.Country == 'Taiwan') | (dsa_df.Founded == 1981)].tail()

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
33,34,5Cd7efccCcba38f,Burch-Ewing,http://cline.net/,Taiwan,User-centric 4thgeneration system engine,1981,Venture Capital / VC,7443.0
88,89,ED889CB2FE9cbd3,Huang and Sons,https://www.bolton.com/,Eritrea,Re-contextualized dynamic hierarchy,1981,Semiconductors,7484.0
93,94,61BDeCfeFD0cEF5,"Valenzuela, Holmes and Rowland",https://www.dorsey.net/,Taiwan,Persistent tertiary focus group,1999,Transportation,1483.0

In [61]:
#Filtrando / slicing  - regras entre (), utilizando NOT (!) , traz 5 exemplos/amostras aleatórios (sample)
dsa_df[ (dsa_df.Country != 'Taiwan') & (dsa_df.Founded != 1981)].sample(5)

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
91,92,4e0719FBE38e0aB,Miles-Dominguez,http://www.turner.com/,Gibraltar,Organized empowering forecast,1996,Civic / Social Organization,897.0
25,26,dFfD6a6F9AC2d9C,"Greene, Benjamin and Novak",http://www.kent.net/,Romania,Centralized leadingedge moratorium,2012,Museums / Institutions,4941.0
95,96,0a0bfFbBbB8eC7c,Holmes Group,https://mcdowell.org/,Ethiopia,Right-sized zero tolerance focus group,1975,Photography,2988.0
65,66,fdFbecbadcdCdf1,"Wilkinson, Charles and Arroyo",http://hunter-mcfarland.com/,United States Virgin Islands,Assimilated 24/7 archive,1996,Building Materials,602.0
34,35,9E6Acb51e3F9d6F,"Glass, Barrera and Turner",https://dunlap.com/,Kyrgyz Republic,Multi-channeled 3rdgeneration open system,2020,Utilities,2610.0

## Agrupamento de dados em DataFrames com Group By

In [68]:
dsa_df[['Country','Industry','Number of employees']].groupby(['Country','Industry']).mean()
# Atenção : o método mean() , média, vai vazer a média de tudo o que não estiver na clausula group by, 
# ou seja, do campo numérico Number of employees. Logo, o valor "que sobra" (no caso Number of employees)
# deve ser sempre numérico!

                                                      Number of employees
Country        Industry
Anguilla       Consumer Services                                   4292.0
Australia      Logistics / Procurement                             4155.0
Bahamas        Primary / Secondary Education                       3498.0
Belarus        Electrical / Electronic Manufacturing               3715.0
Belgium        Pharmaceuticals                                     5038.0
...                                                                   ...
Uzbekistan     Outsourcing / Offshoring                            9698.0
Vietnam        Business Supplies / Equipment                       9097.0
Western Sahara Luxury Goods / Jewelry                              1746.0
Zimbabwe       Gambling / Casinos                                  4873.0
               Mechanical or Industrial Engineering                6135.0

[100 rows x 1 columns]

## Agregação múltipla com Group by

In [70]:
# agg() = aggregation  (nela vão as funções de agregação)
dsa_df[['Country','Industry','Number of employees']].groupby(['Country','Industry']).agg(['mean','std','count'])

                                                     Number of employees      \
                                                                    mean std
Country        Industry
Anguilla       Consumer Services                                  4292.0 NaN
Australia      Logistics / Procurement                            4155.0 NaN
Bahamas        Primary / Secondary Education                      3498.0 NaN
Belarus        Electrical / Electronic Manufacturing              3715.0 NaN
Belgium        Pharmaceuticals                                    5038.0 NaN
...                                                                  ...  ..
Uzbekistan     Outsourcing / Offshoring                           9698.0 NaN
Vietnam        Business Supplies / Equipment                      9097.0 NaN
Western Sahara Luxury Goods / Jewelry                             1746.0 NaN
Zimbabwe       Gambling / Casinos                                 4873.0 NaN
               Mechanical or Industrial Engineering               6135.0 NaN


                                                     count
Country        Industry
Anguilla       Consumer Services                         1
Australia      Logistics / Procurement                   1
Bahamas        Primary / Secondary Education             1
Belarus        Electrical / Electronic Manufacturing     1
Belgium        Pharmaceuticals                           1
...                                                    ...
Uzbekistan     Outsourcing / Offshoring                  1
Vietnam        Business Supplies / Equipment             1
Western Sahara Luxury Goods / Jewelry                    1
Zimbabwe       Gambling / Casinos                        1
               Mechanical or Industrial Engineering      1

[100 rows x 3 columns]

## Filtrando DataFrame do Pandas com base em Strings

In [71]:
dsa_df.head()

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
0,1,FAB0d41d5b5d22c,Ferrell LLC,https://price.net/,Papua New Guinea,Horizontal empowering knowledgebase,1990,Plastics,3498.0
1,2,6A7EdDEA9FaDC52,"Mckinney, Riley and Day",http://www.hall-buchanan.info/,Finland,User-centric system-worthy leverage,2015,Glass / Ceramics / Concrete,4952.0
2,3,0bFED1ADAE4bcC1,Hester Ltd,http://sullivan-reed.com/,China,Switchable scalable moratorium,1971,Public Safety,3498.0
3,4,2bFC1Be8a4ce42f,Holder-Sellers,https://becker.com/,Turkmenistan,De-engineered systemic artificial intelligence,2004,Automotive,3498.0
4,5,9eE8A6a4Eb96C24,Mayer Group,http://www.brewer.com/,Mauritius,Synchronized needs-based challenge,1991,Transportation,3498.0

In [72]:
# Filtrando o dataframe pela coluna Conuntry com valores que iniciam com 'Ma'
dsa_df[dsa_df.Country.str.startswith('Ma')].head()

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
4,5,9eE8A6a4Eb96C24,Mayer Group,http://www.brewer.com/,Mauritius,Synchronized needs-based challenge,1991,Transportation,3498.0
54,55,e24D21BFd3bF1E5,Richard PLC,https://holden-coleman.net/,Mayotte,Object-based optimizing model,1971,Broadcast Media,4942.0
57,58,Bf3F3f62c8aBC33,Cherry PLC,https://www.avila.info/,Marshall Islands,Persistent tertiary website,1980,Plastics,8245.0
86,87,a0a6f9b3DbcBEb5,Mays-Preston,http://www.browning-key.com/,Mali,User-centric heuristic focus group,2006,Military Industry,5786.0

In [73]:
#Filtrando o dataframe pela coluna Country com valores que terminam com as letras 's'
dsa_df[dsa_df.Country.str.endswith('s')].head()

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
4,5,9eE8A6a4Eb96C24,Mayer Group,http://www.brewer.com/,Mauritius,Synchronized needs-based challenge,1991,Transportation,3498.0
5,6,cC757116fe1C085,Henry-Thompson,http://morse.net/,Bahamas,Face-to-face well-modulated customer loyalty,1992,Primary / Secondary Education,3498.0
7,8,ccc93DCF81a31CD,Mcintosh-Mora,https://www.brooks.com/,Heard Island and McDonald Islands,Centralized attitude-oriented capability,1970,Import / Export,4389.0
13,14,D2c91cc03CA394c,Glover-Pope,http://www.silva.biz/,United Arab Emirates,Persevering contextually-based approach,2013,Medical Practice,9079.0
15,16,b5D10A14f7a8AfE,Hodge-Ayers,http://www.archer-elliott.com/,Honduras,Future-proofed radical implementation,1990,Facilities Services,8508.0